# =============================================================================
# Taps (custom repositories)
# =============================================================================
tap "hashicorp/tap"


# =============================================================================
# Formulae
# =============================================================================

brew "atuin" # ------------------> Command line history
brew "bat" # --------------------> A better cat
brew "bottom" # -----------------> A better top
brew "cmake" # ------------------> Cross-platform build tool
brew "coreutils" # --------------> GNU utils
brew "deno" # -------------------> JS runtime
brew "duckdb" # -----------------> Fast analytics
brew "dust" # -------------------> A better du
brew "duf" # --------------------> A better duf
brew "eza" # --------------------> A better ls
brew "fd" # ---------------------> A better find
brew "ffmpeg" # -----------------> Video editor
brew "figlet" # -----------------> ASCII art
brew "fish" # -------------------> A modern shell
brew "fzf" # --------------------> Fuzzy finder
brew "gh" # ---------------------> GitHub CLI
brew "git-lfs" #-----------------> Git plugin for large files
brew "grip" # -------------------> Markdown preview
brew "hexyl" # ------------------> Hex viewer
brew "imagemagick" # ------------> Image processing
brew "jless" # ------------------> JSON exploration
brew "jq" # ---------------------> JSON processing
brew "just" # -------------------> Just a command runner
brew "lua" # --------------------> Scripting language
brew "make" # -------------------> GNU Make
brew "neofetch" # ---------------> System info
brew "neovim" # -----------------> The best IDE
brew "ncdu" # -------------------> Disk usage analyzer
brew "pandoc" # -----------------> Document converter
brew "procs" # ------------------> A better ps
brew "ripgrep" # ----------------> A better grep
brew "starship" # ---------------> Terminal prompt
brew "hashicorp/tap/terraform" #-> Infrastructure-as-code
brew "tldr" # -------------------> Better man pages
brew "transmission-cli" # -------> Bittorrent client
brew "tmux" # -------------------> Terminal session manager
brew "uv" # ---------------------> Python's Cargo
brew "wget" # -------------------> File downloader
brew "yt-dlp" # -----------------> YouTube metadata downloader
brew "zola" # -------------------> Static site generator


# =============================================================================
# Casks
# =============================================================================

## Fonts
cask "audacity" # --------------------> Audio editing
cask "font-fira-code-nerd-font" # ----> Default NerdFont
cask "font-iosevka" # ----------------> Default font
cask "zed" # -------------------------> Another IDE

