# Casks
tap "homebrew/cask-fonts"
tap "hashicorp/tap"

# Formulae

## Apps
brew "transmission-cli"
brew "ffmpeg"
brew "pandoc"


## CLI/terminal tools

brew "parallel"

## -- Cloud
brew "hashicorp/tap/terraform"

## -- Navigation
brew "wget"
brew "starship"
brew "exa"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "tmux"
brew "coreutils"
brew "neovim"
brew "make"


## -- Monitoring
brew "htop"
brew "ncdu"
brew "dust"
brew "duf"
brew "bottom"
brew "iperf3"

## -- Data wrangling
brew "bat"
brew "jq"
brew "duckdb"
brew "hexyl"

## Python
brew "pyenv"
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"

## Lua
brew "lua"


## Web dev
brew "deno"
brew "grip"
brew "gh"
brew "just"
brew "git-lfs"
brew "hugo"

## Fonts
cask "font-monaspace"
cask "font-fira-code-nerd-font"


