# Casks
tap "homebrew/cask-fonts"

# Formulae


## CLI/terminal tools
## -- Navigation
brew "starship"
brew "exa"
brew "fd"
brew "fzf"
brew "ripgrep"

## -- Monitoring
brew "htop"
brew "ncdu"
brew "dust"
brew "duf"
brew "bottom"

## -- Data wrangling
brew "bat"
brew "jq"
brew "duckdb"
brew "hexyl"

## Python
brew "pyenv"

## Web dev
brew "deno"

brew "gh"
brew "just"
brew "git-lfs"

## Fonts
cask "font-monaspace"
cask "font-fira-code-nerd-font"


